app/views/messages/_chut.html.erb

          <p><%= safe_join(message.message.split("\n"),tag(:br)) %></p>
          <span><%= l message.created_at %></span>
---
INSERT INTO "messages" ("user_id", "room_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 2], ["message", "test"], ["created_at", "2021-11-03 11:46:04.267692"], ["updated_at", "2021-11-03 11:46:04.267692"]]