app/views/favorites/_favorites.html.erb

  <%= link_to book_favorites_path(book), method: :delete, remote: true do %>
  <i class="fas fa-heart"></i><%= book.favorites.count %>
---
SELECT COUNT(*) FROM "view_counts" WHERE "view_counts"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

  <%= link_to book_favorites_path(book), method: :post, remote: true do %>
  <i class="fas fa-heart"></i><%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]