app/views/books/_list.html.erb

SELECT  "view_counts".* FROM "view_counts" WHERE "view_counts"."user_id" = ? AND "view_counts"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
---
          <%= link_to user_followeds_path(user.id) do %>
            <%= user.followeds.count %>