app/views/books/index.html.erb

SELECT COUNT(*) FROM "view_counts" WHERE "view_counts"."book_id" = ?  [["book_id", 5]]
---
    <h3>
      <%= @book.errors.count %> error prohibited this obj from being saved:

SELECT COUNT(*) FROM "view_counts" WHERE "view_counts"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
            <td>
              コメント数: <%= book.book_comments.count %>