app/controllers/books_controller.rb

UPDATE "books" SET "impressions_count" = COALESCE("impressions_count", 0) + 1 WHERE "books"."id" = ?  [["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)