app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "リーダブルコード"], ["body", "読みやすいコードとは……"], ["user_id", 1], ["created_at", "2021-10-24 14:02:46.586061"], ["updated_at", "2021-10-24 14:02:46.586061"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id)
      flash[:notice] = "You have created book successfully."
    else
      @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "books".* FROM "books"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 4]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 3], ["created_at", "2021-10-26 00:00:00"], ["created_at", "2021-11-01 23:59:59.999999"]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 2], ["created_at", "2021-10-26 00:00:00"], ["created_at", "2021-11-01 23:59:59.999999"]]
---
  def index
    to = Time.current.at_end_of_day
    from  = (to - 6.day).at_beginning_of_day
    @user = User.find(current_user.id)
    @book = Book.new
    @books = Book.includes(:favorited_users).sort {|a, b|
      b.favorited_users.includes(:favorites).where(created_at: from...to).size <=>
      a.favorited_users.includes(:favorites).where(created_at: from...to).size

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "view_counts".* FROM "view_counts" WHERE "view_counts"."user_id" = ? AND "view_counts"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
INSERT INTO "view_counts" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2021-11-09 14:10:01.361298"], ["updated_at", "2021-11-09 14:10:01.361298"]]
---
  def show
    @book = Book.find(params[:id])
    @new_book = Book.new
    @user = User.find(@book.user.id)
    @book_comment = BookComment.new

    # impressionistを利用した閲覧数のカウント
    # impressionist(@book, nil, unique: [:session_hash.to_s])

    unless ViewCount.find_by(user_id: current_user.id, book_id: @book.id)
      current_user.view_counts.create(book_id: @book.id)