app/controllers/messages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "user_rooms"."room_id" FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 1]]
SELECT  "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" IN (?, ?) LIMIT ?  [["user_id", 3], ["room_id", 1], ["room_id", 2], ["LIMIT", 1]]
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-11-03 10:42:09.272584"], ["updated_at", "2021-11-03 10:42:09.272584"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["created_at", "2021-11-03 10:42:09.290425"], ["updated_at", "2021-11-03 10:42:09.290425"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 1], ["created_at", "2021-11-03 10:42:09.303988"], ["updated_at", "2021-11-03 10:42:09.303988"]]
---
  def show
    @user = User.find(params[:id])
    rooms = current_user.user_rooms.pluck(:room_id)
    user_room = UserRoom.find_by(user_id: @user.id, room_id: rooms)

    if user_room.nil?
      room = Room.new
      room.save
      UserRoom.create(user_id: @user.id, room_id: room.id)
      UserRoom.create(user_id: current_user.id, room_id: room.id)

INSERT INTO "messages" ("user_id", "room_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 2], ["message", "test"], ["created_at", "2021-11-03 10:50:03.622804"], ["updated_at", "2021-11-03 10:50:03.622804"]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "user_rooms"."user_id" FROM "user_rooms" WHERE "user_rooms"."room_id" = ? AND "user_rooms"."user_id" != ?  [["room_id", 2], ["user_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @message = current_user.messages.new(message_params)
    @message.save
    # redirect_back(fallback_location: users_path)
    roomid = @message.room_id
    room = Room.find(roomid)
    userid = UserRoom.where(room_id: roomid).where.not(user_id: current_user.id).pluck(:user_id)
    @user = User.find_by(id: userid)