app/controllers/relationships_controller.rb

  def followeds
    user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]